Data set is taken from [airbnb.xlsx](https://docs.google.com/spreadsheets/d/1BJWyZpZrrRUla_EQ6Pnusy0KH31UMGf2/edit?usp=sharing&ouid=108445376648788204707&rtpof=true&sd=true)

In [1]:
#imports
import pandas as pd

In [2]:
#load the data from Excel

In [4]:
data = pd.read_excel('../data/airbnb.xlsx', sheet_name='AirBnB_NYC')
data.head()

,Host Id,Host Since,Name,Neighbourhood,Property Type,Review Scores Rating (bin),Room Type,Zipcode,Beds,Number of Records,Number Of Reviews,Price,Review Scores Rating
0,5162530,NaT,1 Bedroom in Prime Williamsburg,Brooklyn,Apartment,NaN,Entire home/apt,11249.0,1.0,1,0,145,NaN
1,33134899,NaT,"Sunny, Private room in Bushwick",Brooklyn,Apartment,NaN,Private room,11206.0,1.0,1,1,37,NaN
2,39608626,NaT,Sunny Room in Harlem,Manhattan,Apartment,NaN,Private room,10032.0,1.0,1,1,28,NaN
3,500,2008-06-26,Gorgeous 1 BR with Private Balcony,Manhattan,Apartment,NaN,Entire home/apt,10024.0,3.0,1,0,199,NaN
4,500,2008-06-26,Trendy Times Square Loft,Manhattan,Apartment,95.0,Private room,10036.0,3.0,1,39,549,96.0

In [14]:
data.shape

(30478, 13)

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30478 entries, 0 to 30477
Data columns (total 13 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Host Id                     30478 non-null  int64
 1   Host Since                  30475 non-null  datetime64[ns]
 2   Name                        30478 non-null  object
 3   Neighbourhood               30478 non-null  object
 4   Property Type               30475 non-null  object
 5   Review Scores Rating (bin)  22155 non-null  float64
 6   Room Type                   30478 non-null  object
 7   Zipcode                     30344 non-null  float64
 8   Beds                        30393 non-null  float64
 9   Number of Records           30478 non-null  int64
 10  Number Of Reviews           30478 non-null  int64
 11  Price                       30478 non-null  int64
 12  Review Scores Rating        22155 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(4), object(4)
memory usage: 3.0+ MB

In [13]:
# lets do some cleaning

In [15]:
data.drop_duplicates(inplace=True) #drop duplicate rows

In [16]:
data.shape

(30461, 13)

In [18]:
#from the summary we can see that some of the records contains null values. we try to fill these null values

In [19]:
data['Review Scores Rating'].fillna(0,inplace=True)

In [20]:
data['Review Scores Rating (bin)'].fillna(0,inplace=True)

In [22]:
data['Beds'].fillna(0,inplace=True)

***As the above fields are numerica so we can fill these with 0 as the pattern in the column value suggested***

***Also the few rows having null zipcode as the lacation information is the main property of this dataset so with null location information makes these rows insignificant for analysis therefore we can drop these rows.***

In [25]:
data.dropna(subset=['Zipcode'], inplace=True) #drop null values rows

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30327 entries, 0 to 30477
Data columns (total 13 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Host Id                     30327 non-null  int64
 1   Host Since                  30324 non-null  datetime64[ns]
 2   Name                        30327 non-null  object
 3   Neighbourhood               30327 non-null  object
 4   Property Type               30324 non-null  object
 5   Review Scores Rating (bin)  30327 non-null  float64
 6   Room Type                   30327 non-null  object
 7   Zipcode                     30327 non-null  float64
 8   Beds                        30327 non-null  float64
 9   Number of Records           30327 non-null  int64
 10  Number Of Reviews           30327 non-null  int64
 11  Price                       30327 non-null  int64
 12  Review Scores Rating        30327 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(4), object(4)
memory usage: 3.2+ MB

In [27]:
#Now the data looks cleaner lets save this into Excel sheet to be used in Tableau

In [31]:
data.to_excel('../data/airbnb_cleaned.xlsx',sheet_name='AirBnB_NYC')